RT-Thread/rt-thread/bsp/freescale/platform/devices/MK60D10/include/MK60D10_extension.h
/*******************************************************************************
 * ENET_IAUR - Descriptor Individual Upper Address Register
 ******************************************************************************/

/*!
 * @brief ENET_IAUR - Descriptor Individual Upper Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * IAUR contains the upper 32 bits of the 64-bit individual address hash table.
 * The address recognition process uses this table to check for a possible match
 * with the destination address (DA) field of receive frames with an individual
 * DA. This register is not reset and you must initialize it.
 */
/*!
 * @name Constants and macros for entire ENET_IAUR register
 */
/*@{*/
#define ENET_RD_IAUR(base)       (ENET_IAUR_REG(base))
#define ENET_WR_IAUR(base, value) (ENET_IAUR_REG(base) = (value))
#define ENET_RMW_IAUR(base, mask, value) (ENET_WR_IAUR(base, (ENET_RD_IAUR(base) & ~(mask)) | (value)))
#define ENET_SET_IAUR(base, value) (ENET_WR_IAUR(base, ENET_RD_IAUR(base) |  (value)))
#define ENET_CLR_IAUR(base, value) (ENET_WR_IAUR(base, ENET_RD_IAUR(base) & ~(value)))
#define ENET_TOG_IAUR(base, value) (ENET_WR_IAUR(base, ENET_RD_IAUR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_IALR - Descriptor Individual Lower Address Register
 ******************************************************************************/

/*!
 * @brief ENET_IALR - Descriptor Individual Lower Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * IALR contains the lower 32 bits of the 64-bit individual address hash table.
 * The address recognition process uses this table to check for a possible match
 * with the DA field of receive frames with an individual DA. This register is
 * not reset and you must initialize it.
 */
/*!
 * @name Constants and macros for entire ENET_IALR register
 */
/*@{*/
#define ENET_RD_IALR(base)       (ENET_IALR_REG(base))
#define ENET_WR_IALR(base, value) (ENET_IALR_REG(base) = (value))
#define ENET_RMW_IALR(base, mask, value) (ENET_WR_IALR(base, (ENET_RD_IALR(base) & ~(mask)) | (value)))
#define ENET_SET_IALR(base, value) (ENET_WR_IALR(base, ENET_RD_IALR(base) |  (value)))
#define ENET_CLR_IALR(base, value) (ENET_WR_IALR(base, ENET_RD_IALR(base) & ~(value)))
#define ENET_TOG_IALR(base, value) (ENET_WR_IALR(base, ENET_RD_IALR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_GAUR - Descriptor Group Upper Address Register
 ******************************************************************************/

/*!
 * @brief ENET_GAUR - Descriptor Group Upper Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * GAUR contains the upper 32 bits of the 64-bit hash table used in the address
 * recognition process for receive frames with a multicast address. You must
 * initialize this register.
 */
/*!
 * @name Constants and macros for entire ENET_GAUR register
 */
/*@{*/
#define ENET_RD_GAUR(base)       (ENET_GAUR_REG(base))
#define ENET_WR_GAUR(base, value) (ENET_GAUR_REG(base) = (value))
#define ENET_RMW_GAUR(base, mask, value) (ENET_WR_GAUR(base, (ENET_RD_GAUR(base) & ~(mask)) | (value)))
#define ENET_SET_GAUR(base, value) (ENET_WR_GAUR(base, ENET_RD_GAUR(base) |  (value)))
#define ENET_CLR_GAUR(base, value) (ENET_WR_GAUR(base, ENET_RD_GAUR(base) & ~(value)))
#define ENET_TOG_GAUR(base, value) (ENET_WR_GAUR(base, ENET_RD_GAUR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_GALR - Descriptor Group Lower Address Register
 ******************************************************************************/

/*!
 * @brief ENET_GALR - Descriptor Group Lower Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * GALR contains the lower 32 bits of the 64-bit hash table used in the address
 * recognition process for receive frames with a multicast address. You must
 * initialize this register.
 */
/*!
 * @name Constants and macros for entire ENET_GALR register
 */
/*@{*/
#define ENET_RD_GALR(base)       (ENET_GALR_REG(base))
#define ENET_WR_GALR(base, value) (ENET_GALR_REG(base) = (value))
#define ENET_RMW_GALR(base, mask, value) (ENET_WR_GALR(base, (ENET_RD_GALR(base) & ~(mask)) | (value)))
#define ENET_SET_GALR(base, value) (ENET_WR_GALR(base, ENET_RD_GALR(base) |  (value)))
#define ENET_CLR_GALR(base, value) (ENET_WR_GALR(base, ENET_RD_GALR(base) & ~(value)))
#define ENET_TOG_GALR(base, value) (ENET_WR_GALR(base, ENET_RD_GALR(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_TFWR - Transmit FIFO Watermark Register
 ******************************************************************************/

/*!
 * @brief ENET_TFWR - Transmit FIFO Watermark Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * If TFR[STRFWD] is cleared, TFWR[TFWR] controls the amount of data required in
 * the transmit FIFO before transmission of a frame can begin. This allows you
 * to minimize transmit latency (TFWR = 00 or 01) or allow for larger bus access
 * latency (TFWR = 11) due to contention for the system bus. Setting the watermark
 * to a high value minimizes the risk of transmit FIFO underrun due to
 * contention for the system bus. The byte counts associated with the TFWR field may need
 * to be modified to match a given system requirement. For example, worst case
 * bus access latency by the transmit data DMA channel.
 */
/*!
 * @name Constants and macros for entire ENET_TFWR register
 */
/*@{*/
#define ENET_RD_TFWR(base)       (ENET_TFWR_REG(base))
#define ENET_WR_TFWR(base, value) (ENET_TFWR_REG(base) = (value))
#define ENET_RMW_TFWR(base, mask, value) (ENET_WR_TFWR(base, (ENET_RD_TFWR(base) & ~(mask)) | (value)))
#define ENET_SET_TFWR(base, value) (ENET_WR_TFWR(base, ENET_RD_TFWR(base) |  (value)))
#define ENET_CLR_TFWR(base, value) (ENET_WR_TFWR(base, ENET_RD_TFWR(base) & ~(value)))
#define ENET_TOG_TFWR(base, value) (ENET_WR_TFWR(base, ENET_RD_TFWR(base) ^  (value)))
/*@}*/

