RT-Thread/rt-thread/bsp/freescale/platform/devices/MK60D10/include/MK60D10_extension.h
/*******************************************************************************
 * ENET_RMON_T_PACKETS - RMON Tx packet count (RMON_T_PACKETS)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_PACKETS - RMON Tx packet count (RMON_T_PACKETS) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_PACKETS register
 */
/*@{*/
#define ENET_RD_RMON_T_PACKETS(base) (ENET_RMON_T_PACKETS_REG(base))
#define ENET_WR_RMON_T_PACKETS(base, value) (ENET_RMON_T_PACKETS_REG(base) = (value))
#define ENET_RMW_RMON_T_PACKETS(base, mask, value) (ENET_WR_RMON_T_PACKETS(base, (ENET_RD_RMON_T_PACKETS(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_PACKETS(base, value) (ENET_WR_RMON_T_PACKETS(base, ENET_RD_RMON_T_PACKETS(base) |  (value)))
#define ENET_CLR_RMON_T_PACKETS(base, value) (ENET_WR_RMON_T_PACKETS(base, ENET_RD_RMON_T_PACKETS(base) & ~(value)))
#define ENET_TOG_RMON_T_PACKETS(base, value) (ENET_WR_RMON_T_PACKETS(base, ENET_RD_RMON_T_PACKETS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_PACKETS bitfields
 */

/*!
 * @name Register ENET_RMON_T_PACKETS, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_PACKETS_TXPKTS field. */
#define ENET_RD_RMON_T_PACKETS_TXPKTS(base) ((ENET_RMON_T_PACKETS_REG(base) & ENET_RMON_T_PACKETS_TXPKTS_MASK) >> ENET_RMON_T_PACKETS_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_PACKETS_TXPKTS(base) (ENET_RD_RMON_T_PACKETS_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_BC_PKT - RMON Tx Broadcast Packets (RMON_T_BC_PKT)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_BC_PKT - RMON Tx Broadcast Packets (RMON_T_BC_PKT) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_BC_PKT register
 */
/*@{*/
#define ENET_RD_RMON_T_BC_PKT(base) (ENET_RMON_T_BC_PKT_REG(base))
#define ENET_WR_RMON_T_BC_PKT(base, value) (ENET_RMON_T_BC_PKT_REG(base) = (value))
#define ENET_RMW_RMON_T_BC_PKT(base, mask, value) (ENET_WR_RMON_T_BC_PKT(base, (ENET_RD_RMON_T_BC_PKT(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_BC_PKT(base, value) (ENET_WR_RMON_T_BC_PKT(base, ENET_RD_RMON_T_BC_PKT(base) |  (value)))
#define ENET_CLR_RMON_T_BC_PKT(base, value) (ENET_WR_RMON_T_BC_PKT(base, ENET_RD_RMON_T_BC_PKT(base) & ~(value)))
#define ENET_TOG_RMON_T_BC_PKT(base, value) (ENET_WR_RMON_T_BC_PKT(base, ENET_RD_RMON_T_BC_PKT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_BC_PKT bitfields
 */

/*!
 * @name Register ENET_RMON_T_BC_PKT, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_BC_PKT_TXPKTS field. */
#define ENET_RD_RMON_T_BC_PKT_TXPKTS(base) ((ENET_RMON_T_BC_PKT_REG(base) & ENET_RMON_T_BC_PKT_TXPKTS_MASK) >> ENET_RMON_T_BC_PKT_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_BC_PKT_TXPKTS(base) (ENET_RD_RMON_T_BC_PKT_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_MC_PKT - RMON Tx Multicast Packets (RMON_T_MC_PKT)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_MC_PKT - RMON Tx Multicast Packets (RMON_T_MC_PKT) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_MC_PKT register
 */
/*@{*/
#define ENET_RD_RMON_T_MC_PKT(base) (ENET_RMON_T_MC_PKT_REG(base))
#define ENET_WR_RMON_T_MC_PKT(base, value) (ENET_RMON_T_MC_PKT_REG(base) = (value))
#define ENET_RMW_RMON_T_MC_PKT(base, mask, value) (ENET_WR_RMON_T_MC_PKT(base, (ENET_RD_RMON_T_MC_PKT(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_MC_PKT(base, value) (ENET_WR_RMON_T_MC_PKT(base, ENET_RD_RMON_T_MC_PKT(base) |  (value)))
#define ENET_CLR_RMON_T_MC_PKT(base, value) (ENET_WR_RMON_T_MC_PKT(base, ENET_RD_RMON_T_MC_PKT(base) & ~(value)))
#define ENET_TOG_RMON_T_MC_PKT(base, value) (ENET_WR_RMON_T_MC_PKT(base, ENET_RD_RMON_T_MC_PKT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_MC_PKT bitfields
 */

/*!
 * @name Register ENET_RMON_T_MC_PKT, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_MC_PKT_TXPKTS field. */
#define ENET_RD_RMON_T_MC_PKT_TXPKTS(base) ((ENET_RMON_T_MC_PKT_REG(base) & ENET_RMON_T_MC_PKT_TXPKTS_MASK) >> ENET_RMON_T_MC_PKT_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_MC_PKT_TXPKTS(base) (ENET_RD_RMON_T_MC_PKT_TXPKTS(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_T_CRC_ALIGN - RMON Tx Packets w CRC/Align error (RMON_T_CRC_ALIGN)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_T_CRC_ALIGN - RMON Tx Packets w CRC/Align error (RMON_T_CRC_ALIGN) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_T_CRC_ALIGN register
 */
/*@{*/
#define ENET_RD_RMON_T_CRC_ALIGN(base) (ENET_RMON_T_CRC_ALIGN_REG(base))
#define ENET_WR_RMON_T_CRC_ALIGN(base, value) (ENET_RMON_T_CRC_ALIGN_REG(base) = (value))
#define ENET_RMW_RMON_T_CRC_ALIGN(base, mask, value) (ENET_WR_RMON_T_CRC_ALIGN(base, (ENET_RD_RMON_T_CRC_ALIGN(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_T_CRC_ALIGN(base, value) (ENET_WR_RMON_T_CRC_ALIGN(base, ENET_RD_RMON_T_CRC_ALIGN(base) |  (value)))
#define ENET_CLR_RMON_T_CRC_ALIGN(base, value) (ENET_WR_RMON_T_CRC_ALIGN(base, ENET_RD_RMON_T_CRC_ALIGN(base) & ~(value)))
#define ENET_TOG_RMON_T_CRC_ALIGN(base, value) (ENET_WR_RMON_T_CRC_ALIGN(base, ENET_RD_RMON_T_CRC_ALIGN(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_T_CRC_ALIGN bitfields
 */

/*!
 * @name Register ENET_RMON_T_CRC_ALIGN, field TXPKTS[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_T_CRC_ALIGN_TXPKTS field. */
#define ENET_RD_RMON_T_CRC_ALIGN_TXPKTS(base) ((ENET_RMON_T_CRC_ALIGN_REG(base) & ENET_RMON_T_CRC_ALIGN_TXPKTS_MASK) >> ENET_RMON_T_CRC_ALIGN_TXPKTS_SHIFT)
#define ENET_BRD_RMON_T_CRC_ALIGN_TXPKTS(base) (ENET_RD_RMON_T_CRC_ALIGN_TXPKTS(base))
/*@}*/

