RT-Thread/rt-thread/bsp/freescale/platform/devices/MK60D10/include/MK60D10_extension.h
/*******************************************************************************
 * ENET_IEEE_T_CSERR - Frames Transmitted with Carrier Sense Error (IEEE_T_CSERR)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_CSERR - Frames Transmitted with Carrier Sense Error (IEEE_T_CSERR) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_CSERR register
 */
/*@{*/
#define ENET_RD_IEEE_T_CSERR(base) (ENET_IEEE_T_CSERR_REG(base))
#define ENET_WR_IEEE_T_CSERR(base, value) (ENET_IEEE_T_CSERR_REG(base) = (value))
#define ENET_RMW_IEEE_T_CSERR(base, mask, value) (ENET_WR_IEEE_T_CSERR(base, (ENET_RD_IEEE_T_CSERR(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_T_CSERR(base, value) (ENET_WR_IEEE_T_CSERR(base, ENET_RD_IEEE_T_CSERR(base) |  (value)))
#define ENET_CLR_IEEE_T_CSERR(base, value) (ENET_WR_IEEE_T_CSERR(base, ENET_RD_IEEE_T_CSERR(base) & ~(value)))
#define ENET_TOG_IEEE_T_CSERR(base, value) (ENET_WR_IEEE_T_CSERR(base, ENET_RD_IEEE_T_CSERR(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_CSERR bitfields
 */

/*!
 * @name Register ENET_IEEE_T_CSERR, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_T_CSERR_COUNT field. */
#define ENET_RD_IEEE_T_CSERR_COUNT(base) ((ENET_IEEE_T_CSERR_REG(base) & ENET_IEEE_T_CSERR_COUNT_MASK) >> ENET_IEEE_T_CSERR_COUNT_SHIFT)
#define ENET_BRD_IEEE_T_CSERR_COUNT(base) (ENET_RD_IEEE_T_CSERR_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_T_SQE - Frames Transmitted with SQE Error (IEEE_T_SQE). NOTE: Counter not implemented (read 0 always) as no SQE information is available.
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_SQE - Frames Transmitted with SQE Error (IEEE_T_SQE). NOTE: Counter not implemented (read 0 always) as no SQE information is available. (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_SQE register
 */
/*@{*/
#define ENET_RD_IEEE_T_SQE(base) (ENET_IEEE_T_SQE_REG(base))
#define ENET_WR_IEEE_T_SQE(base, value) (ENET_IEEE_T_SQE_REG(base) = (value))
#define ENET_RMW_IEEE_T_SQE(base, mask, value) (ENET_WR_IEEE_T_SQE(base, (ENET_RD_IEEE_T_SQE(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_T_SQE(base, value) (ENET_WR_IEEE_T_SQE(base, ENET_RD_IEEE_T_SQE(base) |  (value)))
#define ENET_CLR_IEEE_T_SQE(base, value) (ENET_WR_IEEE_T_SQE(base, ENET_RD_IEEE_T_SQE(base) & ~(value)))
#define ENET_TOG_IEEE_T_SQE(base, value) (ENET_WR_IEEE_T_SQE(base, ENET_RD_IEEE_T_SQE(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_T_FDXFC - Flow Control Pause frames transmitted (IEEE_T_FDXFC)
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_FDXFC - Flow Control Pause frames transmitted (IEEE_T_FDXFC) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_FDXFC register
 */
/*@{*/
#define ENET_RD_IEEE_T_FDXFC(base) (ENET_IEEE_T_FDXFC_REG(base))
#define ENET_WR_IEEE_T_FDXFC(base, value) (ENET_IEEE_T_FDXFC_REG(base) = (value))
#define ENET_RMW_IEEE_T_FDXFC(base, mask, value) (ENET_WR_IEEE_T_FDXFC(base, (ENET_RD_IEEE_T_FDXFC(base) & ~(mask)) | (value)))
#define ENET_SET_IEEE_T_FDXFC(base, value) (ENET_WR_IEEE_T_FDXFC(base, ENET_RD_IEEE_T_FDXFC(base) |  (value)))
#define ENET_CLR_IEEE_T_FDXFC(base, value) (ENET_WR_IEEE_T_FDXFC(base, ENET_RD_IEEE_T_FDXFC(base) & ~(value)))
#define ENET_TOG_IEEE_T_FDXFC(base, value) (ENET_WR_IEEE_T_FDXFC(base, ENET_RD_IEEE_T_FDXFC(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_IEEE_T_FDXFC bitfields
 */

/*!
 * @name Register ENET_IEEE_T_FDXFC, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_IEEE_T_FDXFC_COUNT field. */
#define ENET_RD_IEEE_T_FDXFC_COUNT(base) ((ENET_IEEE_T_FDXFC_REG(base) & ENET_IEEE_T_FDXFC_COUNT_MASK) >> ENET_IEEE_T_FDXFC_COUNT_SHIFT)
#define ENET_BRD_IEEE_T_FDXFC_COUNT(base) (ENET_RD_IEEE_T_FDXFC_COUNT(base))
/*@}*/

/*******************************************************************************
 * ENET_IEEE_T_OCTETS_OK - Octet count for Frames Transmitted w/o Error (IEEE_T_OCTETS_OK). NOTE: Counts total octets (includes header and FCS fields).
 ******************************************************************************/

/*!
 * @brief ENET_IEEE_T_OCTETS_OK - Octet count for Frames Transmitted w/o Error (IEEE_T_OCTETS_OK). NOTE: Counts total octets (includes header and FCS fields). (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_IEEE_T_OCTETS_OK register
 */
/*@{*/
#define ENET_RD_IEEE_T_OCTETS_OK(base) (ENET_IEEE_T_OCTETS_OK_REG(base))
/*@}*/

/*******************************************************************************
 * ENET_RMON_R_PACKETS - RMON Rx packet count (RMON_R_PACKETS)
 ******************************************************************************/

/*!
 * @brief ENET_RMON_R_PACKETS - RMON Rx packet count (RMON_R_PACKETS) (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire ENET_RMON_R_PACKETS register
 */
/*@{*/
#define ENET_RD_RMON_R_PACKETS(base) (ENET_RMON_R_PACKETS_REG(base))
#define ENET_WR_RMON_R_PACKETS(base, value) (ENET_RMON_R_PACKETS_REG(base) = (value))
#define ENET_RMW_RMON_R_PACKETS(base, mask, value) (ENET_WR_RMON_R_PACKETS(base, (ENET_RD_RMON_R_PACKETS(base) & ~(mask)) | (value)))
#define ENET_SET_RMON_R_PACKETS(base, value) (ENET_WR_RMON_R_PACKETS(base, ENET_RD_RMON_R_PACKETS(base) |  (value)))
#define ENET_CLR_RMON_R_PACKETS(base, value) (ENET_WR_RMON_R_PACKETS(base, ENET_RD_RMON_R_PACKETS(base) & ~(value)))
#define ENET_TOG_RMON_R_PACKETS(base, value) (ENET_WR_RMON_R_PACKETS(base, ENET_RD_RMON_R_PACKETS(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ENET_RMON_R_PACKETS bitfields
 */

/*!
 * @name Register ENET_RMON_R_PACKETS, field COUNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the ENET_RMON_R_PACKETS_COUNT field. */
#define ENET_RD_RMON_R_PACKETS_COUNT(base) ((ENET_RMON_R_PACKETS_REG(base) & ENET_RMON_R_PACKETS_COUNT_MASK) >> ENET_RMON_R_PACKETS_COUNT_SHIFT)
#define ENET_BRD_RMON_R_PACKETS_COUNT(base) (ENET_RD_RMON_R_PACKETS_COUNT(base))
/*@}*/

