RT-Thread/rt-thread/bsp/freescale/platform/devices/MK60D10/include/MK60D10_extension.h
/*******************************************************************************
 * FMC_TAGVD - Cache Tag Storage
 ******************************************************************************/

/*!
 * @brief FMC_TAGVD - Cache Tag Storage (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache is a 4-way, set-associative cache with 8 sets. The ways are
 * numbered 0-3 and the sets are numbered 0-7. In TAGVDWxSy, x denotes the way, and y
 * denotes the set. This section represents tag/vld information for all sets in the
 * indicated way.
 */
/*!
 * @name Constants and macros for entire FMC_TAGVD register
 */
/*@{*/
#define FMC_RD_TAGVD(base, index, index2) (FMC_TAGVD_REG(base, index, index2))
#define FMC_WR_TAGVD(base, index, index2, value) (FMC_TAGVD_REG(base, index, index2) = (value))
#define FMC_RMW_TAGVD(base, index, index2, mask, value) (FMC_WR_TAGVD(base, index, index2, (FMC_RD_TAGVD(base, index, index2) & ~(mask)) | (value)))
#define FMC_SET_TAGVD(base, index, index2, value) (FMC_WR_TAGVD(base, index, index2, FMC_RD_TAGVD(base, index, index2) |  (value)))
#define FMC_CLR_TAGVD(base, index, index2, value) (FMC_WR_TAGVD(base, index, index2, FMC_RD_TAGVD(base, index, index2) & ~(value)))
#define FMC_TOG_TAGVD(base, index, index2, value) (FMC_WR_TAGVD(base, index, index2, FMC_RD_TAGVD(base, index, index2) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual FMC_TAGVD bitfields
 */

/*!
 * @name Register FMC_TAGVD, field valid[0] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVD_valid field. */
#define FMC_RD_TAGVD_valid(base, index, index2) ((FMC_TAGVD_REG(base, index, index2) & FMC_TAGVD_valid_MASK) >> FMC_TAGVD_valid_SHIFT)
#define FMC_BRD_TAGVD_valid(base, index, index2) (BITBAND_ACCESS32(&FMC_TAGVD_REG(base, index, index2), FMC_TAGVD_valid_SHIFT))

/*! @brief Set the valid field to a new value. */
#define FMC_WR_TAGVD_valid(base, index, index2, value) (FMC_RMW_TAGVD(base, index, index2, FMC_TAGVD_valid_MASK, FMC_TAGVD_valid(value)))
#define FMC_BWR_TAGVD_valid(base, index, index2, value) (BITBAND_ACCESS32(&FMC_TAGVD_REG(base, index, index2), FMC_TAGVD_valid_SHIFT) = (value))
/*@}*/

/*!
 * @name Register FMC_TAGVD, field tag[18:6] (RW)
 */
/*@{*/
/*! @brief Read current value of the FMC_TAGVD_tag field. */
#define FMC_RD_TAGVD_tag(base, index, index2) ((FMC_TAGVD_REG(base, index, index2) & FMC_TAGVD_tag_MASK) >> FMC_TAGVD_tag_SHIFT)
#define FMC_BRD_TAGVD_tag(base, index, index2) (FMC_RD_TAGVD_tag(base, index, index2))

/*! @brief Set the tag field to a new value. */
#define FMC_WR_TAGVD_tag(base, index, index2, value) (FMC_RMW_TAGVD(base, index, index2, FMC_TAGVD_tag_MASK, FMC_TAGVD_tag(value)))
#define FMC_BWR_TAGVD_tag(base, index, index2, value) (FMC_WR_TAGVD_tag(base, index, index2, value))
/*@}*/

/*******************************************************************************
 * FMC_DATA_U - Cache Data Storage (upper word)
 ******************************************************************************/

/*!
 * @brief FMC_DATA_U - Cache Data Storage (upper word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of 64-bit entries is a 4-way, set-associative cache with 8 sets.
 * The ways are numbered 0-3 and the sets are numbered 0-7. In DATAWxSyU and
 * DATAWxSyL, x denotes the way, y denotes the set, and U and L represent upper and
 * lower word, respectively. This section represents data for the upper word (bits
 * [63:32]) of all sets in the indicated way.
 */
/*!
 * @name Constants and macros for entire FMC_DATA_U register
 */
/*@{*/
#define FMC_RD_DATA_U(base, index, index2) (FMC_DATA_U_REG(base, index, index2))
#define FMC_WR_DATA_U(base, index, index2, value) (FMC_DATA_U_REG(base, index, index2) = (value))
#define FMC_RMW_DATA_U(base, index, index2, mask, value) (FMC_WR_DATA_U(base, index, index2, (FMC_RD_DATA_U(base, index, index2) & ~(mask)) | (value)))
#define FMC_SET_DATA_U(base, index, index2, value) (FMC_WR_DATA_U(base, index, index2, FMC_RD_DATA_U(base, index, index2) |  (value)))
#define FMC_CLR_DATA_U(base, index, index2, value) (FMC_WR_DATA_U(base, index, index2, FMC_RD_DATA_U(base, index, index2) & ~(value)))
#define FMC_TOG_DATA_U(base, index, index2, value) (FMC_WR_DATA_U(base, index, index2, FMC_RD_DATA_U(base, index, index2) ^  (value)))
/*@}*/

/*******************************************************************************
 * FMC_DATA_L - Cache Data Storage (lower word)
 ******************************************************************************/

/*!
 * @brief FMC_DATA_L - Cache Data Storage (lower word) (RW)
 *
 * Reset value: 0x00000000U
 *
 * The cache of 64-bit entries is a 4-way, set-associative cache with 8 sets.
 * The ways are numbered 0-3 and the sets are numbered 0-7. In DATAWxSyU and
 * DATAWxSyL, x denotes the way, y denotes the set, and U and L represent upper and
 * lower word, respectively. This section represents data for the lower word (bits
 * [31:0]) of all sets in the indicated way.
 */
/*!
 * @name Constants and macros for entire FMC_DATA_L register
 */
/*@{*/
#define FMC_RD_DATA_L(base, index, index2) (FMC_DATA_L_REG(base, index, index2))
#define FMC_WR_DATA_L(base, index, index2, value) (FMC_DATA_L_REG(base, index, index2) = (value))
#define FMC_RMW_DATA_L(base, index, index2, mask, value) (FMC_WR_DATA_L(base, index, index2, (FMC_RD_DATA_L(base, index, index2) & ~(mask)) | (value)))
#define FMC_SET_DATA_L(base, index, index2, value) (FMC_WR_DATA_L(base, index, index2, FMC_RD_DATA_L(base, index, index2) |  (value)))
#define FMC_CLR_DATA_L(base, index, index2, value) (FMC_WR_DATA_L(base, index, index2, FMC_RD_DATA_L(base, index, index2) & ~(value)))
#define FMC_TOG_DATA_L(base, index, index2, value) (FMC_WR_DATA_L(base, index, index2, FMC_RD_DATA_L(base, index, index2) ^  (value)))
/*@}*/

/*
 * MK60D10 FTFL
 *
 * Flash Memory Interface
 *
 * Registers defined in this header file:
 * - FTFL_FSTAT - Flash Status Register
 * - FTFL_FCNFG - Flash Configuration Register
 * - FTFL_FSEC - Flash Security Register
 * - FTFL_FOPT - Flash Option Register
 * - FTFL_FCCOB3 - Flash Common Command Object Registers
 * - FTFL_FCCOB2 - Flash Common Command Object Registers
 * - FTFL_FCCOB1 - Flash Common Command Object Registers
 * - FTFL_FCCOB0 - Flash Common Command Object Registers
 * - FTFL_FCCOB7 - Flash Common Command Object Registers
 * - FTFL_FCCOB6 - Flash Common Command Object Registers
 * - FTFL_FCCOB5 - Flash Common Command Object Registers
 * - FTFL_FCCOB4 - Flash Common Command Object Registers
 * - FTFL_FCCOBB - Flash Common Command Object Registers
 * - FTFL_FCCOBA - Flash Common Command Object Registers
 * - FTFL_FCCOB9 - Flash Common Command Object Registers
 * - FTFL_FCCOB8 - Flash Common Command Object Registers
 * - FTFL_FPROT3 - Program Flash Protection Registers
 * - FTFL_FPROT2 - Program Flash Protection Registers
 * - FTFL_FPROT1 - Program Flash Protection Registers
 * - FTFL_FPROT0 - Program Flash Protection Registers
 * - FTFL_FEPROT - EEPROM Protection Register
 * - FTFL_FDPROT - Data Flash Protection Register
 */

#define FTFL_INSTANCE_COUNT (1U) /*!< Number of instances of the FTFL module. */
#define FTFL_IDX (0U) /*!< Instance number for FTFL. */

