RT-Thread/rt-thread/bsp/freescale/platform/devices/MK60D10/include/MK60D10_extension.h
/*******************************************************************************
 * FTFL_FCCOB6 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFL_FCCOB6 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFL_FCCOB6 register
 */
/*@{*/
#define FTFL_RD_FCCOB6(base)     (FTFL_FCCOB6_REG(base))
#define FTFL_WR_FCCOB6(base, value) (FTFL_FCCOB6_REG(base) = (value))
#define FTFL_RMW_FCCOB6(base, mask, value) (FTFL_WR_FCCOB6(base, (FTFL_RD_FCCOB6(base) & ~(mask)) | (value)))
#define FTFL_SET_FCCOB6(base, value) (FTFL_WR_FCCOB6(base, FTFL_RD_FCCOB6(base) |  (value)))
#define FTFL_CLR_FCCOB6(base, value) (FTFL_WR_FCCOB6(base, FTFL_RD_FCCOB6(base) & ~(value)))
#define FTFL_TOG_FCCOB6(base, value) (FTFL_WR_FCCOB6(base, FTFL_RD_FCCOB6(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFL_FCCOB5 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFL_FCCOB5 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFL_FCCOB5 register
 */
/*@{*/
#define FTFL_RD_FCCOB5(base)     (FTFL_FCCOB5_REG(base))
#define FTFL_WR_FCCOB5(base, value) (FTFL_FCCOB5_REG(base) = (value))
#define FTFL_RMW_FCCOB5(base, mask, value) (FTFL_WR_FCCOB5(base, (FTFL_RD_FCCOB5(base) & ~(mask)) | (value)))
#define FTFL_SET_FCCOB5(base, value) (FTFL_WR_FCCOB5(base, FTFL_RD_FCCOB5(base) |  (value)))
#define FTFL_CLR_FCCOB5(base, value) (FTFL_WR_FCCOB5(base, FTFL_RD_FCCOB5(base) & ~(value)))
#define FTFL_TOG_FCCOB5(base, value) (FTFL_WR_FCCOB5(base, FTFL_RD_FCCOB5(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFL_FCCOB4 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFL_FCCOB4 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFL_FCCOB4 register
 */
/*@{*/
#define FTFL_RD_FCCOB4(base)     (FTFL_FCCOB4_REG(base))
#define FTFL_WR_FCCOB4(base, value) (FTFL_FCCOB4_REG(base) = (value))
#define FTFL_RMW_FCCOB4(base, mask, value) (FTFL_WR_FCCOB4(base, (FTFL_RD_FCCOB4(base) & ~(mask)) | (value)))
#define FTFL_SET_FCCOB4(base, value) (FTFL_WR_FCCOB4(base, FTFL_RD_FCCOB4(base) |  (value)))
#define FTFL_CLR_FCCOB4(base, value) (FTFL_WR_FCCOB4(base, FTFL_RD_FCCOB4(base) & ~(value)))
#define FTFL_TOG_FCCOB4(base, value) (FTFL_WR_FCCOB4(base, FTFL_RD_FCCOB4(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFL_FCCOBB - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFL_FCCOBB - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFL_FCCOBB register
 */
/*@{*/
#define FTFL_RD_FCCOBB(base)     (FTFL_FCCOBB_REG(base))
#define FTFL_WR_FCCOBB(base, value) (FTFL_FCCOBB_REG(base) = (value))
#define FTFL_RMW_FCCOBB(base, mask, value) (FTFL_WR_FCCOBB(base, (FTFL_RD_FCCOBB(base) & ~(mask)) | (value)))
#define FTFL_SET_FCCOBB(base, value) (FTFL_WR_FCCOBB(base, FTFL_RD_FCCOBB(base) |  (value)))
#define FTFL_CLR_FCCOBB(base, value) (FTFL_WR_FCCOBB(base, FTFL_RD_FCCOBB(base) & ~(value)))
#define FTFL_TOG_FCCOBB(base, value) (FTFL_WR_FCCOBB(base, FTFL_RD_FCCOBB(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFL_FCCOBA - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFL_FCCOBA - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFL_FCCOBA register
 */
/*@{*/
#define FTFL_RD_FCCOBA(base)     (FTFL_FCCOBA_REG(base))
#define FTFL_WR_FCCOBA(base, value) (FTFL_FCCOBA_REG(base) = (value))
#define FTFL_RMW_FCCOBA(base, mask, value) (FTFL_WR_FCCOBA(base, (FTFL_RD_FCCOBA(base) & ~(mask)) | (value)))
#define FTFL_SET_FCCOBA(base, value) (FTFL_WR_FCCOBA(base, FTFL_RD_FCCOBA(base) |  (value)))
#define FTFL_CLR_FCCOBA(base, value) (FTFL_WR_FCCOBA(base, FTFL_RD_FCCOBA(base) & ~(value)))
#define FTFL_TOG_FCCOBA(base, value) (FTFL_WR_FCCOBA(base, FTFL_RD_FCCOBA(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFL_FCCOB9 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFL_FCCOB9 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFL_FCCOB9 register
 */
/*@{*/
#define FTFL_RD_FCCOB9(base)     (FTFL_FCCOB9_REG(base))
#define FTFL_WR_FCCOB9(base, value) (FTFL_FCCOB9_REG(base) = (value))
#define FTFL_RMW_FCCOB9(base, mask, value) (FTFL_WR_FCCOB9(base, (FTFL_RD_FCCOB9(base) & ~(mask)) | (value)))
#define FTFL_SET_FCCOB9(base, value) (FTFL_WR_FCCOB9(base, FTFL_RD_FCCOB9(base) |  (value)))
#define FTFL_CLR_FCCOB9(base, value) (FTFL_WR_FCCOB9(base, FTFL_RD_FCCOB9(base) & ~(value)))
#define FTFL_TOG_FCCOB9(base, value) (FTFL_WR_FCCOB9(base, FTFL_RD_FCCOB9(base) ^  (value)))
/*@}*/

